Revit 2027 API
PlanTopologySet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual PlanTopologySetIterator ForwardIterator()
Public Overridable Function ForwardIterator As PlanTopologySetIterator
public:
virtual PlanTopologySetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> PlanTopologySetIterator
override ForwardIterator : unit -> PlanTopologySetIterator
Return Value
PlanTopologySetIterator
Returns a forward moving iterator to the set.
See Also
Reference
PlanTopologySet Class
Autodesk.Revit.DB Namespace